src/test_scripts/generated_xmls/3510_15961868_4.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><InsertTx5xxSample xmlns="http://cometsystem.cz/schemas/soapTx5xx_v2.xsd"><passKey>15961868</passKey><device>3510</device><temp>16.3</temp><relHum>28.5</relHum><compQuant>7.7</compQuant><pressure>-9999</pressure><alarms>yes,yes,no,yes</alarms><compType>Dew point</compType><tempU>C</tempU><pressureU>n/a</pressureU><timer>10</timer></InsertTx5xxSample></soap:Body></soap:Envelope>